<?php
/**
 * @copyright 2019-2020 Dicr http://dicr.org
 * @author Igor A Tarasov <develop@dicr.org>
 * @license proprietary
 * @version 11.07.20 15:24:41
 */

/** @noinspection SpellCheckingInspection */
declare(strict_types = 1);

return [
    'товар' => 'товар',
    'товара' => 'товари',
    'товаров' => 'товарів',

    'модель' => 'модель',
    'модели' => 'моделі',
    'моделей' => 'моделей',

    'месяц' => 'місяць',
    'месяца' => 'місяці',
    'месяцев' => 'місяців',

    'сегодня' => 'сьогодні',
    'завтра' => 'завтра',
    'послезавтра' => 'післязавтра',

    'через день' => 'через день',
    'через {num} день' => 'через {num} день',
    'через {num} дня' => 'через {num} дні',
    'через {num} дней' => 'через {num} днів',

    'через неделю' => 'через тиждень',
    'через {num} неледю' => 'через {num} тиждень',
    'через {num} недели' => 'через {num} тижні',
    'через {num} недель' => 'через {num} тижнів',

    'через месяц' => 'через місяць',
    'через {num} месяц' => 'через {num} місяць',
    'через {num} месяца' => 'через {num} місяці',
    'через {num} месяцев' => 'через {num} місяців',

    'Пн' => 'Пн',
    'Вт' => 'Вт',
    'Ср' => 'Ср',
    'Чт' => 'Чт',
    'Пт' => 'Пт',
    'Сб' => 'Сб',
    'Вс' => 'Нд',

    'выходной' => 'вихідний',

    'янв' => 'січ',
    'фев' => 'лют',
    'мар' => 'бер',
    'апр' => 'кві',
    'май' => 'тра',
    'июн' => 'чер',
    'июл' => 'лип',
    'авг' => 'сер',
    'сен' => 'вер',
    'окт' => 'жов',
    'ноя' => 'лис',
    'дек' => 'гру',

    // с большой буквы для того чтобы "май" не совпадал с индексом коротких названий
    'Январь' => 'Січень',
    'Февраль' => 'Лютий',
    'Март' => 'Березень',
    'Апрель' => 'Квітень',
    'Май' => 'Травень',
    'Июнь' => 'Червень',
    'Июль' => 'Липень',
    'Август' => 'Серпень',
    'Сентябрь' => 'Вересень',
    'Октябрь' => 'Жовтень',
    'Ноябрь' => 'Листопад',
    'Декабрь' => 'Грудень',

    'января' => 'січня',
    'февраля' => 'лютого',
    'марта' => 'березня',
    'апреля' => 'квітня',
    'мая' => 'травня',
    'июня' => 'червня',
    'июля' => 'липня',
    'августа' => 'серпня',
    'сентября' => 'вересня',
    'октября' => 'жовтня',
    'ноября' => 'листопада',
    'декабря' => 'грудня',
];

